Lab12/basic/controllers/ArticlesController.php

    protected function findModel($id)
    {
        if (($model = Articles::findOne(['id' => $id])) !== null) {
---
SELECT * FROM `articles` WHERE `id`='1'